#Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

A = int(input())
B = int(input())
if sum == 0:
    pass
else:
    sum = A + B
print(sum)